[
    {
        "pergunta": "Tic-tac-toe, it's easy",
        "resposta": "You don't even need to :)"
    },
    {
        "pergunta": "Your sock drawer contains 10 pairs of white socks and 10 pairs of black socks. Suppose you are in the dark and need to pick one sock at a time, without knowing which. How many socks do you need to pick to ensure you have a matching pair?",
        "resposta": "3"
    },
    {
        "pergunta": "What is the name of the volcano that erupted in 2010 and closed much of the airspace over Europe?",
        "resposta": "Eyjafjallajökull"
    },
    {
        "pergunta": "What are the 2 numbers whose product is 48 and, when the larger number is divided by the smaller number, the result is 3?",
        "resposta": "12, 4"
    },
    {
        "pergunta": "If 'one and a half boys' can eat one and a half hot dogs in one and a half minutes, how many hot dogs can 6 boys eat in 6 minutes? Numbers only. For example: '10' if you want to say 10 hot dogs.",
        "resposta": "24"
    },
    {
        "pergunta": "37.2350° N, 115.8111° W",
        "resposta": "Area 51"
    },
    {
        "pergunta": "In a certain country, 1/2 of 5 = 3. Assuming the same proportion, what would be the value of 1/3 of 10?",
        "resposta": "4"
    },
    {
        "pergunta": "072 097 099 107 101 114 032 087 097 114 115",
        "resposta": "Hacker Wars"
    },
    {
        "pergunta": "Setec Astronomy",
        "resposta": "too many secrets"
    },
    {
        "pergunta": "SODUKU",
        "resposta": "Use the HexBot, only to solve this puzzle, continuous use risks banning. Download Bot\nUSAGE: enter the puzzle you want to solve and click the 'Solve riddle' button"
    },
    {
        "pergunta": "2048",
        "resposta": "Use the HexBot, only to solve this puzzle, continuous use risks banning. Download Bot\nUSAGE: enter the puzzle you want to solve and click the 'Solve riddle' button"
    },
    {
        "pergunta": "01010011 01110100 01100001 01111001 01001000 01110101 01101110 01100111 01110010 01111001 00101100 01010011 01110100 01100001 01111001 01000110 01101111 01101111 01101100 01101001 01110011 01101000",
        "resposta": "Stay Hungry, Stay Foolish"
    },
    {
        "pergunta": "In Alexander Dumas' book, 'The Three Musketeers,' two of the musketeers are named Athos and Porthos. What was the name of the third Musketeer?",
        "resposta": "Aramis"
    },
    {
        "pergunta": "A boy can eat 100 chocolate bars in half a minute. Another boy can eat half that amount in double the time. How many chocolate bars can both boys eat together in 15 seconds?",
        "resposta": "62.5"
    },
    {
        "pergunta": "Potatoes are composed of 99% water and only 1% 'potato material.' João bought 100 kg of potatoes and left them in the yard, taking a 'sunbath.' When he came back, he saw that the potatoes had dehydrated and now contained only 98% water. At that moment, what was the new weight of the potatoes? Numbers only, do not include kg. For example: '10' if you want to say 10 kg.",
        "resposta": "50"
    },
    {
        "pergunta": "A farmer went to his bank manager to ask for a loan to buy animals. The manager made a deal with him. He said he would lend R$ 100.00, and the farmer would not need to repay the money if he could buy exactly 100 heads (animals) with the R$ 100.00. The only rule of the deal was that the farmer must buy at least one animal of each of these types: cows, pigs, and sheep. Each cow costs R$ 10.00. Each pig costs R$ 3.00 and each sheep costs R$ 0.50. How many animals of each type did the farmer buy? Separate the resposta with commas. Example: 'X, Y, Z' (X cows, Y pigs, and Z sheep)",
        "resposta": "5, 1, 94"
    },
    {
        "pergunta": "Minesweeper",
        "resposta": "Use the HexBot, only to solve this puzzle, continuous use risks banning. Download Bot\nUSAGE: enter the puzzle you want to solve and click the 'Solve riddle' button"
    },
    {
        "pergunta": "Renato said that Naomy had been the winner, with Milena coming in second place. Matheus said that Phoebe won, with Naomy in second place. In fact, neither of them told the whole truth about the science fair results. Each of them made one true and one false statement about the ranking. What was the true ranking of the competitors? resposta using the names of the first, second, and third place, respectively. Example: Melchior, Gaspar, Baltazar",
        "resposta": "Phoebe, Milena, Naomy"
    },
    {
        "pergunta": "You own a pet store and have canaries to organize in cages. If you put 1 canary per cage, there will be one canary left outside the cage, meaning there are not enough cages. If you put 2 canaries per cage, there will be one empty cage left. How many canaries and how many cages do you have? Separate the resposta with commas. For example: 'X, Y' (X canaries, Y cages)",
        "resposta": "4, 3"
    },
    {
        "pergunta": "Five competitors (A, B, C, D, and E) are competing in a swimming race that awards gold, silver, and bronze medals for 1st, 2nd, and 3rd places, respectively. The following conclusions about the race are false, but one statement from each of them (note that each conclusion has two statements) could be true. A did not win gold, and B did not win silver; D did not win silver, and B did not win bronze; C won a medal, while D won none; A won a medal, while C won none; D won a medal, and E also won a medal. resposta using the letter of the first, second, and third place, respectively. Example: X, Y, Z",
        "resposta": "A, D, C"
    },
    {
        "pergunta": "A whale is 15 meters long. Its head is as long as its tail. If the head were twice as long as it actually is, the head and tail together would be as long as the rest of the whale's body (the part between the tail and the head). What are the lengths of the head, tail, and the rest of the body? Separate the resposta with commas. For example: 'X, Y, Z' (X meters for the head, Y meters for the tail, and Z meters for the rest of the body)",
        "resposta": "3, 3, 9"
    },
    {
        "pergunta": "Brent, Corrigan, and Bieber went bird-watching. Each saw a bird that none of the others saw. Each pair among them saw a bird that the third person did not see. Finally, there was one bird that all three saw. Of the birds Brent saw, 2 were yellow. Of the birds Corrigan saw, 3 were yellow. Of the birds Bieber saw, 4 were yellow. How many yellow birds were seen in total? How many birds of other colors were seen in total? resposta the perguntas by separating with commas. Example: 3, 4",
        "resposta": "5, 2"
    },
    {
        "pergunta": "How could you express the number 100 using only six instances of the digit '9', with no other digits, and with only two operations? You can use fractions. Do not include spaces in the resposta. (Ex: 5+3*2)",
        "resposta": "99+99/99"
    },
    {
        "pergunta": "Two alligator breeders (breeder I and breeder II) were talking, and during the conversation, they noticed a curious coincidence. If breeder I sold 7 alligators to breeder II, breeder I would have the same number of alligators as breeder II. On the other hand, if breeder II sold 7 alligators to breeder I, breeder I would have exactly double the number of alligators as breeder II. How many alligators does each of them have? Separate the resposta with commas. Example: 'X, Y' (X alligators for breeder I, Y alligators for breeder II)",
        "resposta": "49, 35"
    },
    {
        "pergunta": "∀x Player(x) ^ (∃y,z Premium(y) ^ Purchase(x, y, z)) => Beautiful(x) You need to get at least 90% of the original resposta correct.",
        "resposta": "PORTUGUESE: Every player who buys premium is beautiful\nENGLISH: Every player that buys premium is awesome"
    },
    {
        "pergunta": "A group consisting of sheep and chickens has a total of 99 feet and heads (counted together, meaning it is not correct to say there are 99 feet and 99 heads, as only the total is known, not the value of each separately). There are twice as many chickens as sheep. How many animals of each type (sheep and chickens) are in this group? Separate the resposta with commas. Example: 'X, Y' (X sheep, Y chickens)",
        "resposta": "9, 18"
    },
    {
        "pergunta": "/bb|[^b]{2}/ Regular Expression.",
        "resposta": "To be or not to be"
    },
    {
        "pergunta": "Riddle: What was Renato's dog's name? Note: The dog belonging to our lord and savior, Renato Massaro. Note: if using the bot automatically, after it grabs the IP for the next riddle, it will bug and invade the wrong IP. Suggest doing the invasion manually.",
        "resposta": "Phoebe"
    },
    {
        "pergunta": "Lights Out",
        "resposta": "Use the HexBot, only to solve this puzzle, continuous use risks banning. Download Bot\nUSAGE: enter the puzzle you want to solve and click the 'Solve riddle' button"
    },
    {
        "pergunta": "What has a head, a tail, is brown, and has no legs? Note: Please resposta with one word. Note: if using the bot to solve automatically, CRC 5.3 is not sufficient. Try downloading SSH from the last riddle, invade via SSH, disable hash, and invade again via CRC. You will also need a port scan, which you can download from the download center.",
        "resposta": "penny"
    },
    {
        "pergunta": "What is the oldest hotel in the world? Note: Please resposta with three words.",
        "resposta": "Nishiyama Onsen Keiunkan"
    },
    {
        "pergunta": "Decode the following: SGFjayBUaGUgUGxhbmV0 Note: May the Base gods be with you",
        "resposta": "Hack The Planet"
    },
    {
        "pergunta": "Decrypt this hash: '482c811da5d5b4bc6d497ffa98491e38'. Note: It is a common password.",
        "resposta": "password123"
    },
    {
      "pergunta": "A small number of cards has been lost from a complete pack. If I deal among four people, three cards remain. If I deal among three people, two remain and if I deal among five people, two cards remain. How many cards are there?",
      "resposta": "47"
    },
    {
        "pergunta": "Decrypt this: '... .... --- .-- / -. --- / .-. . -- --- .-. ... .'. Note: It rhymes with horse.. The resposta is 3 words all lowercase",
        "resposta": "show no remorse"
    },
    {
        "pergunta": "Which 3 numbers have the same result, whether added or multiplied? Note: Separate each number with a comma",
        "resposta": "1, 2, 3"
    },
    {
        "pergunta": "Decode the names of the three jewels: iatdnaem, buir, sfaari Note: Separate each word with a comma and space",
        "resposta": "diamond, ruby, sapphire"
    },
    {
        "pergunta": "From which movie did the term 'hackerman' originate? Note: Hackerman",
        "resposta": "Kung Fury"
    },
    {
        "pergunta": "Who said this quote? 'This is your last chance. After this, there is no turning back. You take the blue pill – the story ends, you wake up in your bed and believe whatever you want to believe. You take the red pill – you stay in Wonderland and I show you how deep the rabbit-hole goes.' Note: Matrix",
        "resposta": "Morpheus"
    },
    {
        "pergunta": "Riddle: What is the plain text of this message? 44-2-222-55-33-777 Note: Number Cipher",
        "resposta": "hacker"
    },
    {
        "pergunta": "What is the most popular YouTube song in November 2019? Note: Please respond with just the name",
        "resposta": "Despacito"
    },
    {
        "pergunta": "What is the name of the museum where this computer is located? image here Note: There are no clues in the image itself, give your resposta as an acronym",
        "resposta": "lcm+l"
    },
    {
        "pergunta": "What is the tallest building in the world? Note: Dubai",
        "resposta": "Burj Khalifa"
    },
    {
        "pergunta": "What is the name of the person who developed Bitcoin? Note: resposta with first and last name",
        "resposta": "Satoshi Nakamoto"
    },
    {
        "pergunta": "What is the hash function used by Bitcoin? Note: Do not add spaces in your resposta",
        "resposta": "sha256"
    },
    {
        "pergunta": "When was Hackerwars.io launched? Note: Provide your resposta in month/day/year format",
        "resposta": "10/11/2019"
    },
    {
        "pergunta": "fsk you Note: Provide your resposta in month/day/year format",
        "resposta": "No answer"
    }
  ]
  